Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: You can disable unused features (such as animations, file system, GPU etc.) and widget types in *lv_conf.h*.
it_it: Si possono disabilitare le funzionalità inutilizzate (come animazioni, file system, GPU, ecc.) e i tipi di widget in *lv_conf.h*.

source: You can display SVG files in your application.
it_it: È possibile visualizzare file SVG nella propria applicazione.

source: You can do this by:
it_it: È possibile farlo in questo modo:

source: You can do this in the following way:
it_it: È possibile farlo nel modo seguente:

source: You can do this with :cpp:expr:`lv_obj_set_ext_click_area(widget, size)`.
it_it: Lo si può fare con :cpp:expr:`lv_obj_set_ext_click_area(widget, size)`.

source: You can download it from `this link <https://github.com/lvgl/lvgl_editor/releases/download/v1.0.0/LVGL_Pro_e2.studio_plugin.v1.0.0.zip>`_.
it_it: Lo si può scaricare da `questo link <https://github.com/lvgl/lvgl_editor/releases/download/v1.0.0/LVGL_Pro_e2.studio_plugin.v1.0.0.zip>`_.

source: You can download the "Alif Security Toolkit Quick Start Guide" from https://alifsemi.com/support/software-tools/ensemble/ , assuming you have created an account, to learn how to use the Alif SE Tools to perform low-level manipulations on your board.
it_it: È possibile scaricare la "Alif Security Toolkit Quick Start Guide" da https://alifsemi.com/support/software-tools/ensemble/, presupponendo che sia stato creato un account, per imparare a utilizzare gli strumenti Alif SE per eseguire manipolazioni di basso livello sulla scheda.

source: You can draw various content on a layer and then render the layer with a ``clip_radius``, masking out all the content on the corners.
it_it: È possibile disegnare vari contenuti su un layer e quindi renderizzare il layer con un ``clip_radius``, mascherando tutto il contenuto sugli angoli.

source: You can dynamically modify node properties (position, rotation, scale) at runtime and receive notifications when these values change.
it_it: È possibile modificare dinamicamente le proprietà dei nodi (posizione, rotazione, scala) in fase di esecuzione e ricevere notifiche quando questi valori cambiano.

source: You can edit ``lv_conf.defaults`` --- a sparse version of ``lv_conf.h`` which you can use to regenerate ``lv_conf.h`` by running
it_it: È possibile modificare ``lv_conf.defaults`` --- una versione sparsa di ``lv_conf.h`` che è possibile utilizzare per rigenerare ``lv_conf.h`` eseguendo

source: You can either maintain the default configuration or modify it according to your preferences.
it_it: È possibile mantenere la configurazione di default o modificarla in base alle proprie preferenze.

source: You can either use one of the existing drivers provided with lv_micropython, or you can create your own input/display drivers for your specific hardware.
it_it: È possibile utilizzare uno dei driver esistenti forniti con lv_micropython oppure creare driver di input/display personalizzati per l'hardware specifico.

source: You can even run commands interactively using the `REPL <https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop>`__ (the interactive prompt)
it_it: È anche possibile eseguire comandi in modo interattivo utilizzando `REPL <https://en.wikipedia.org/wiki/Read%E2%80%93eval%E2%80%93print_loop>`__ (il prompt interattivo)

source: You can even use a different name for ``lv_conf.h``.
it_it: È anche possibile utilizzare un nome diverso per ``lv_conf.h``.

source: You can find more information about this variable `here <https://meta-raspberrypi.readthedocs.io/en/latest/ipcompliance.html#linux-firmware-rpidistro>`_.
it_it: Ulteriori informazioni su questa variabile sono disponibili `qui <https://meta-raspberrypi.readthedocs.io/en/latest/ipcompliance.html#linux-firmware-rpidistro>`_.

source: You can find procedures and learn about tools (i.e. ``bitbake-layers``) for creating layers suitable for the Yocto Project in the "`understanding and creating layers <https://docs.yoctoproject.org/dev-manual/ layers.html#understanding-and-creating-layers>`_" section of the Yocto Project Development Tasks Manual.
it_it: È possibile trovare procedure e informazioni sugli strumenti (ad esempio ``bitbake-layers``) per la creazione di layer adatti al Progetto Yocto nella sezione "`comprensione e creazione di layer <https://docs.yoctoproject.org/dev-manual/ layers.html#understanding-and-creating-layers>`_" dello Yocto Project Development Tasks Manual.

source: You can find the current :cpp:type:`lv_property_t` struct in the `lv_obj_property.h <https://github.com/lvgl/lvgl/blob/master/src/core/lv_obj_property.h>`__ file.
it_it: Si può trovare la struttura :cpp:type:`lv_property_t` corrente nel file `lv_obj_property.h <https://github.com/lvgl/lvgl/blob/master/src/core/lv_obj_property.h>`__.

source: You can force Flex to put an item into a new line with :cpp:expr:`lv_obj_add_flag(child, LV_OBJ_FLAG_FLEX_IN_NEW_TRACK)`.
it_it: È possibile forzare Flex a inserire un elemento in una nuova riga con :cpp:expr:`lv_obj_add_flag(child, LV_OBJ_FLAG_FLEX_IN_NEW_TRACK)`.

source: You can fully control the user interface without a touchpad or mouse by using only a keypad.
it_it: È possibile controllare completamente l'interfaccia utente senza touchpad o mouse, utilizzando solo un keypad.

source: You can get more details about how BitBake chooses between different target versions and providers in the "`Preferences <https://docs.yoctoproject.org/bitbake/2.8/bitbake-user-manual/ bitbake-user-manual-execution.html#preferences>`_" section of the BitBake User Manual.
it_it: Per maggiori dettagli su come BitBake sceglie tra diverse versioni target e provider, consultare la sezione "`Preferences <https://docs.yoctoproject.org/bitbake/2.8/bitbake-user-manual/ bitbake-user-manual-execution.html#preferences>`_" del Manuale Utente di BitBake.

source: You can get pointers to each of these screens on a specified display by using (respectively):
it_it: È possibile ottenere puntatori a ciascuna di queste schermate su un display specificato utilizzando (rispettivamente):

source: You can get pointers to each of these screens on the :ref:`default_display` by using (respectively):
it_it: È possibile ottenere puntatori a ciascuna di queste schermate sul :ref:`default_display` utilizzando (rispettivamente):

source: You can get the idle percentage time of :cpp:func:`lv_timer_handler` with :cpp:func:`lv_timer_get_idle`.
it_it: È possibile ottenere la percentuale di tempo di inattività di :cpp:func:`lv_timer_handler` con :cpp:func:`lv_timer_get_idle`.

source: You can hide a cursor without removing it from the chart by using :cpp:func:`lv_chart_set_cursor_point` by passing :c:macro:`LV_CHART_POINT_NONE` as the point id.
it_it: È possibile nascondere un cursore senza rimuoverlo dal grafico utilizzando :cpp:func:`lv_chart_set_cursor_point` passando :c:macro:`LV_CHART_POINT_NONE` come ID del punto.

source: You can hide a point by setting its Y-value to :c:macro:`LV_CHART_POINT_NONE`.
it_it: È possibile nascondere un punto impostando il suo valore Y su :c:macro:`LV_CHART_POINT_NONE`.

source: You can insert text or characters to the current cursor's position with:
it_it: Si può inserire testo o caratteri nella posizione corrente del cursore con:

source: You can make a Timer repeat only a given number of times with :cpp:expr:`lv_timer_set_repeat_count(timer, count)`.
it_it: È possibile impostare un timer in modo che si ripeta solo un determinato numero di volte con :cpp:expr:`lv_timer_set_repeat_count(timer, count)`.

source: You can manually trigger an activity using :cpp:expr:`lv_display_trigger_activity(display1)`.
it_it: È possibile avviare manualmente un'attività utilizzando :cpp:expr:`lv_display_trigger_activity(display1)`.

source: You can modify these Timer parameters at any time during its life:
it_it: È possibile modificare i parametri del Timer in qualsiasi momento durante il suo ciclo di vita:

source: You can move the cursor one character-position (or line) at a time with
it_it: È possibile spostare il cursore di una posizione (o riga) alla volta con

source: You can optimize this by taking the following measures:
it_it: È possibile ottimizzare questa situazione adottando le seguenti misure:

source: You can override the default "masking" character with :cpp:expr:`lv_textarea_set_password_bullet(textarea, str)` where ``str`` is a NUL-terminated C string.
it_it: È possibile sovrascrivere il carattere di "mascheramento" di default con :cpp:expr:`lv_textarea_set_password_bullet(textarea, str)` dove ``str`` è una stringa C terminata da NUL.

source: You can pass multiple flags by ORing them together:
it_it: È possibile passare più flag combinandoli tramite OR:

source: You can position a widget relative to any side or corner of the parent:
it_it: È possibile posizionare un widget rispetto a qualsiasi lato o angolo del genitore:

source: You can prepare a frogfs blob with minified XML files.
it_it: Si può preparare un blob frogfs con file XML minimizzati.

source: You can programmatically check, un-check, and disable the Checkbox by using the common state add/clear function:
it_it: È possibile il "check" [selezionare], "un-check" [deselezionare] e disabilitare la Checkbox tramite codice utilizzando la funzione di aggiunta/cancellazione dello stato comune:

source: You can provide a callback function which will be called when a new device is added.
it_it: È possibile fornire una funzione di callback che verrà richiamata quando viene aggiunto un nuovo dispositivo.

source: You can reach it by either clicking the gear icon on the bottom bar or by navigating to the CMSIS panel on the left and clicking the gear at the top of that view.
it_it: Vi si può accedere cliccando sull'icona a forma di ingranaggio nella barra inferiore oppure andando al pannello CMSIS a sinistra e cliccando sull'ingranaggio in alto.

source: You can refer to the configuration instructions above to use a higher precision timestamp.
it_it: È possibile fare riferimento alle istruzioni di configurazione sopra riportate per utilizzare un timestamp con maggiore precisione.

source: You can register a function to have it be called periodically.
it_it: È possibile registrare una funzione per farla chiamare periodicamente.

source: You can remove a Span at any time during the Spangroup's life using the function :cpp:expr:`lv_spangroup_delete_span(spangroup, span)`.
it_it: È possibile rimuovere uno Span in qualsiasi momento durante la vita dello Spangroup utilizzando la funzione :cpp:expr:`lv_spangroup_delete_span(spangroup, span)`.

source: You can remove all the children of a widget (but not the widget itself) using :cpp:expr:`lv_obj_clean(widget)`.
it_it: È possibile rimuovere tutti gli elementi figlio di un widget (ma non il widget stesso) utilizzando :cpp:expr:`lv_obj_clean(widget)`.

source: You can remove it and replace it with a custom event handler if you wish, or add an additional call-back of your own.
it_it: È possibile rimuoverlo e sostituirlo con un gestore eventi personalizzato, oppure aggiungerne uno personalizzato.

source: You can retrieve the pointer passed when setting the callback function like this:
it_it: È possibile recuperare il puntatore passato impostando la funzione di callback in questo modo:

source: You can reverse this sequence if you wish, making the ticks and labels appear on top the main line, using :cpp:expr:`lv_scale_set_draw_ticks_on_top(scale, true)`.
it_it: È possibile invertire questa sequenza facendo apparire le tacche e le etichette sopra la linea principale, utilizzando :cpp:expr:`lv_scale_set_draw_ticks_on_top(scale, true)`.

source: You can run each task manually to understand what is generated each step, or you can run ``bitbake lvgl`` to run all the tasks.
it_it: È possibile eseguire ogni task manualmente per capire cosa viene generato in ogni passaggio, oppure è possibile eseguire ``bitbake lvgl`` per eseguire tutti i task.

source: You can see ``lv_conf.defaults`` for a summary of the configs which have been changed from the defaults.
it_it: È possibile consultare ``lv_conf.defaults`` per un riepilogo delle configurazioni modificate rispetto a quelle di default.

source: You can see that the parent's corners do not clip the children.
it_it: Si può notare che gli angoli del genitore non ritagliano i figli.

source: You can see what it looks like on GitHub for LVGL here: https://github.com/lvgl/lvgl/pulls.
it_it: Si può vedere come appare su GitHub per LVGL qui: https://github.com/lvgl/lvgl/pulls.

source: You can select an option programmatically with :cpp:expr:`lv_dropdown_set_selected(dropdown, id)`, where ``id`` is the index of the target option.
it_it: È possibile selezionare un'opzione a livello di codice con :cpp:expr:`lv_dropdown_set_selected(dropdown, id)`, dove ``id`` è l'indice dell'opzione target.

source: You can select an option programmatically with :cpp:expr:`lv_roller_set_selected(roller, id, LV_ANIM_ON)`, where *id* is the zero-based index of the list item to be selected.
it_it: È possibile selezionare un'opzione a livello di codice con :cpp:expr:`lv_roller_set_selected(roller, id, LV_ANIM_ON)`, dove *id* è l'indice a partire da zero dell'elemento della lista da selezionare.

source: You can separate the (S) directory and the directory pointed to by the B variable.
it_it: È possibile separare la directory (S) e la directory puntata dalla variabile B.

source: You can set a left, right and middle image, and the middle image will be repeated to match the width of the Widget.
it_it: È possibile impostare un'immagine a sinistra, a destra e al centro; l'immagine al centro verrà ripetuta per adattarsi alla larghezza del widget.

source: You can set a list of accepted characters with :cpp:expr:`lv_textarea_set_accepted_chars(textarea, list)` where ``list`` is a pointer to a NUL-terminated string, or NULL to accept all characters.
it_it: È possibile impostare un elenco di caratteri accettati con :cpp:expr:`lv_textarea_set_accepted_chars(textarea, list)` dove ``list`` è un puntatore a una stringa terminata da NULL, oppure NULL per accettare tutti i caratteri.

source: You can set a symbol as an image source with :cpp:expr:`lv_image_set_src(img1, LV_SYMBOL_OK)`.
it_it: È possibile impostare un simbolo come sorgente dell'immagine con :cpp:expr:`lv_image_set_src(img1, LV_SYMBOL_OK)`.

source: You can set custom LED ON and OFF brightness values by defining macros ``LV_LED_BRIGHT_MAX`` and ``LV_LED_BRIGHT_MIN`` in your project.
it_it: È possibile impostare valori di luminosità LED ON e OFF personalizzati definendo le macro ``LV_LED_BRIGHT_MAX`` e ``LV_LED_BRIGHT_MIN`` nel progetto.

source: You can set header modes with :cpp:expr:`lv_menu_set_mode_header(menu, LV_MENU_HEADER...)`.
it_it: È possibile impostare le modalità dell'intestazione con :cpp:expr:`lv_menu_set_mode_header(menu, LV_MENU_HEADER...)`.

source: You can set root back button modes with :cpp:expr:`lv_menu_set_mode_root_back_button(menu, LV_MENU_ROOT_BACK_BTN...)`.
it_it: È possibile impostare le modalità del pulsante "root back" con :cpp:expr:`lv_menu_set_mode_root_back_button(menu, LV_MENU_ROOT_BACK_BTN...)`.

source: You can set the color of the LED with :cpp:expr:`lv_led_set_color(led, lv_color_hex(0xff0080))`.
it_it: È possibile impostare il colore del LED con :cpp:expr:`lv_led_set_color(led, lv_color_hex(0xff0080))`.

source: You can set the macro :c:macro:`LV_USE_DRAW_ARM2D_ASYNC` to ``1`` in ``lv_conf.h`` to enable Arm-2D Asynchronous acceleration for LVGL.
it_it: È possibile impostare la macro :c:macro:`LV_USE_DRAW_ARM2D_ASYNC` a ``1`` in ``lv_conf.h`` per abilitare l'accelerazione asincrona Arm-2D per LVGL.

source: You can set the text on a Label at runtime with :cpp:expr:`lv_label_set_text(label, "New text")`.
it_it: È possibile impostare il testo su un'etichetta in fase di esecuzione con :cpp:expr:`lv_label_set_text(label, "New text")`.

source: You can set their brightness with :cpp:expr:`lv_led_set_brightness(led, brightness)`.
it_it: È possibile impostare la luminosità con :cpp:expr:`lv_led_set_brightness(led, brightness)`.

source: You can set/get these attributes with ``lv_obj_set_...`` and ``lv_obj_get_...`` functions.
it_it: È possibile impostare/ottenere questi attributi con le funzioni ``lv_obj_set_...`` e ``lv_obj_get_...``.

source: You can simply pass the path to the font as usual on your operating system or platform.
it_it: È sufficiente passare il path del font come di consueto sul sistema operativo o sulla piattaforma.

source: You can specify a duration and repeat count.
it_it: È possibile specificare una durata e un numero di ripetizioni.

source: You can specify a new map (layout) for the Keyboard with :cpp:expr:`lv_keyboard_set_map(kb, LV_KEYBOARD_MODE_..., kb_map, kb_ctrl)`.
it_it: È possibile specificare una nuova mappa (layout) per la tastiera con :cpp:expr:`lv_keyboard_set_map(kb, LV_KEYBOARD_MODE_..., kb_map, kb_ctrl)`.

source: You can specify the long mode with :cpp:expr:`lv_label_set_long_mode(label, LV_LABEL_LONG_...)`
it_it: È possibile specificare la modalità lunga con :cpp:expr:`lv_label_set_long_mode(label, LV_LABEL_LONG_...)`

source: You can specify the minimum and maximum values in Y-direction with :cpp:expr:`lv_chart_set_axis_range(chart, axis, min, max)`.
it_it: È possibile specificare i valori minimo e massimo in direzione Y con :cpp:expr:`lv_chart_set_axis_range(chart, axis, min, max)`.

source: You can start in less than 10 minutes on a M5Stack or equivalent device in less than 10 minutes in this `short tutorial <https://tasmota.github.io/docs/LVGL_in_10_minutes/>`__
it_it: Si può iniziare in meno di 10 minuti su un M5Stack o un dispositivo equivalente in meno di 10 minuti con questo `breve tutorial <https://tasmota.github.io/docs/LVGL_in_10_minutes/>`__

source: You can tell which names are available by looking in the ``.c`` files in the ``./src/widgets/property/`` directory.
it_it: È possibile verificare quali nomi sono disponibili esaminando i file ``.c`` nella directory ``./src/widgets/property/``.

source: You can temporarily disable Timer handling with :cpp:expr:`lv_timer_enable(false)`.
it_it: È possibile disabilitare temporaneamente la gestione dei Timer con :cpp:expr:`lv_timer_enable(false)`.

source: You can then add the filter to your ``frogfs.yaml``.
it_it: È quindi possibile aggiungere il filtro al file ``frogfs.yaml``.

source: You can then print the logs to serial with a callback function, for example:
it_it: È quindi possibile stampare i log su seriale con una funzione di callback, ad esempio:

source: You can then use that font anywhere :cpp:struct:`lv_font_t` is accepted.
it_it: Si può quindi utilizzare quel font ovunque sia accettato :cpp:struct:`lv_font_t`.

source: You can think of LVGL as a collection of C and H files that can be dropped into any project to add UI capabilities to the product.
it_it: LVGL può essere considerato come una raccolta di file C e H inseribili in qualsiasi progetto per aggiungere funzionalità di interfaccia utente al prodotto.

source: You can think of ``lv_ime_pinyin`` as a Pinyin input method plug-in for the Keyboard Widget.
it_it: Si può pensare a ``lv_ime_pinyin`` come a un plug-in del metodo di input Pinyin per il Widget Keyboard.

source: You can think of a ``<preview>`` tag as an ``lv_obj`` where the following properties can be used:
it_it: Si può pensare a un tag ``<preview>`` come a un ``lv_obj`` in cui possono essere utilizzate le seguenti proprietà:

source: You can try ``/dev/ttyACM0``.
it_it: Si può provare ``/dev/ttyACM0``.

source: You can try out LVGL **using only your PC** (i.e. without any development boards).
it_it: Si può provare LVGL **utilizzando solo il PC** (ovvero senza alcuna scheda di sviluppo).

source: You can use **astyle** to format the code.
it_it: È possibile utilizzare **astyle** per formattare il codice.

source: You can use :cpp:expr:`lv_file_explorer_set_sort(explorer, LV_EXPLORER_SORT_XX)` to set the sorting method.
it_it: È possibile utilizzare :cpp:expr:`lv_file_explorer_set_sort(explorer, LV_EXPLORER_SORT_XX)` per impostare il metodo di "sort" [ordinamento].

source: You can use :cpp:expr:`lv_ime_pinyin_set_dict(pinyin_ime, your_dict)` to use a custom dictionary.
it_it: Si può usare :cpp:expr:`lv_ime_pinyin_set_dict(pinyin_ime, your_dict)` per usare un dizionario personalizzato.

source: You can use :cpp:expr:`lv_obj_delete_delayed(widget, 1000)` to delete a widget after some time.
it_it: Si può usare :cpp:expr:`lv_obj_delete_delayed(widget, 1000)` per eliminare un widget dopo un certo periodo di tempo.

source: You can use :cpp:expr:`lv_timer_set_auto_delete(timer, false)` if you want the timer to instead be paused after it has run ``count`` times.
it_it: È possibile utilizzare :cpp:expr:`lv_timer_set_auto_delete(timer, false)` se si desidera che il timer venga messo in pausa dopo essere stato eseguito ``count`` volte.

source: You can use CMSIS-PACKS or add it manually.
it_it: Si può utilizzare CMSIS-PACKS o aggiungerla manualmente.

source: You can use GIMP to save the image in the required format.
it_it: È possibile utilizzare GIMP per salvare l'immagine nel formato richiesto.

# You can use `` `` to make a line break.
source: You can use ``\n`` to make a line break.
it_it: È possibile utilizzare ``\n`` per creare un'interruzione di riga.

source: You can use ``evtest`` to show data from that event source to see if it is actually the one you want.
it_it: Si può usare ``evtest`` per visualizzare i dati da quella sorgente di eventi e verificare se è effettivamente quella desiderata.

source: You can use ``ifconfig`` or ``ip a`` to find your IP address.
it_it: Si può usare ``ifconfig`` o ``ip a`` per trovare il proprio indirizzo IP.

source: You can use ``menuconfig``:
it_it: È possibile utilizzare ``menuconfig``:

source: You can use an external decoding library or write your own.
it_it: È possibile utilizzare una libreria di decodifica esterna o scriverne una propria.

source: You can use animation from files or raw data (text).
it_it: Si può utilizzare l'animazione da file o da dati grezzi (testo).

source: You can use direct or partial mode.
it_it: È possibile utilizzare la modalità diretta o parziale.

source: You can use fragment manager to build a navigation stack, or a multi-pane application easily.
it_it: È possibile utilizzare il gestore dei frammenti per creare facilmente uno stack di navigazione o un'applicazione multi-pannello.

source: You can use it as a reference for adding LVGL to your own NuttX app.
it_it: La si può usare come riferimento per aggiungere LVGL alla propria app NuttX.

source: You can use it to perform custom rendering with a GPU, or replace the parts of the built-in software rendering logic to any extent desired.
it_it: È possibile utilizzarla per eseguire rendering personalizzati con una GPU o sostituire parti della logica di rendering software integrata nella misura desiderata.

source: You can use it to, for example, customize the file sort.
it_it: Lo si può utilizzare, ad esempio, per personalizzare l'ordinamento dei file.

source: You can use percentages for dynamic positioning:
it_it: È possibile utilizzare le percentuali per il posizionamento dinamico:

source: You can use the :cpp:func:`my_lcd_send_cmd` function to send an arbitrary command to the LCD controller.
it_it: È possibile utilizzare la funzione :cpp:func:`my_lcd_send_cmd` per inviare un comando arbitrario al controller LCD.

source: You can zoom images in or out by using :cpp:expr:`lv_image_set_scale(img, factor)`.
it_it: È possibile ingrandire o ridurre le immagini utilizzando :cpp:expr:`lv_image_set_scale(img, factor)`.

source: You configure the major and minor ticks of a Scale by calling 2 functions:
it_it: È possibile configurare le tacche maggiori e minori di una "Scale" chiamando 2 funzioni:
